# TAPS
# ---------------
tap "homebrew/bundle"
tap "brewforge/chinese"
tap "steveyegge/beads"
tap "moonrepo/tap"
tap "nikitabobko/tap"

# BINARIES
# ---------------
# Updated built-in GNU utilities
brew "coreutils"    # GNU file, shell, and text utilities
brew "binutils"     # GNU binary tools for native development
brew "diffutils"    # GNU file comparison utilities
brew "findutils"    # GNU find, xargs, and locate
brew "grep"         # GNU grep, egrep and fgrep
brew "gawk"         # GNU awk utility
brew "gnu-sed"      # GNU implementation of the famous stream editor
brew "gnu-tar"      # GNU version of the tar archiving utility
brew "gnu-which"    # GNU implementation of which utility
brew "gnutls"       # GNU transport layer security (TLS)
brew "gzip"         # Data compression program
brew "watch"        # Run commands periodically
brew "difftastic"   # Structural diff tool
brew "wget"         # Resuming download util

# Terminal
brew "bash"         # Bourne-Again SHell (modern version)
brew "zsh"          # Z shell
brew "tmux"         # terminal workspace

# Modern CLI Replacements
brew "aria2"        # Resuming download util (better wget)
brew "curlie"       # The ease of use of httpie (better curl)
brew "fd"           # Find entries (better find)
brew "eza"          # Listing files with info (better ls)
brew "ripgrep"      # The silver searcher (better grep)
brew "bat"          # Output highlighting (better cat)
brew "procs"        # Advanced process viewer (better ps)
brew "dust"         # Display disk usage (better du)
brew "duf"          # Get info on mounted disks (better df)
brew "zoxide"       # Auto-learning navigation (better cd)
brew "tealdeer"     # Community-maintained docs (better man)
brew "gping"        # Interactive ping tool (better ping)
brew "broot"        # Navigate directory trees (better tree)
brew "bottom"       # Cross-platform graphical process/system monitor (better top)
brew "viu"          # Terminal image viewer (kitty graphics protocol)

# Utilities
brew "fzf"          # Fuzzy Finder
brew "atuin"        # Fly through your shell history
brew "topgrade"     # Upgrade everything
brew "navi"         # An interactive cheatsheet tool for the command-line
brew "direnv"       # Load and unload environment variables
brew "nexttrace"    # Visual route tracking
brew "ast-grep"     # Code structural search
brew "carapace"     # Multi-shell argument completer
brew "aichat"       # All-in-one AI CLI tool

# Editor
brew "vim"          # Vi 'workalike' with many additional features
brew "neovim"       # New vim
brew "glow"         # Markdown reader

# General development tools
brew "cmake"        # Cross-platform make
brew "git"          # Distributed revision control system
brew "git-lfs"      # Git extension for versioning large files
brew "git-delta"    # Syntax-highlighting pager for git and diff output
brew "git-absorb"   # Automatically fixup commits
brew "lazygit"      # Simple terminal UI for git commands
brew "gh"           # Interact with GitHub PRs, issues, repos
brew "tokei"        # Count code (better cloc)
brew "stow"         # Symlink farm manager
brew "bd"           # A memory upgrade for your coding agent
brew "lefthook"     # Git hooks manager
brew "moon"         # Monorepo
brew "jq"           # Command-line JSON processor
brew "just"         # Just a command runner
brew "docker"       # Docker CLI client
brew "mole"         # SSH tunnel tool

# Programming languages
brew "mise"         # env vars, task runner
brew "lua"          # Powerful, efficient scripting language

# Mac OS X
brew "mas"          # Mac App Store command-line interface
brew "sketchybar"   # Custom macOS statusbar
brew "sleepwatcher" # Run scripts on sleep/wake events
cask "aerospace"    # Tiling window manager

# CASK
# ---------------
# Storage
cask "baidunetdisk"
cask "adrive"
cask "quarkclouddrive"

# Browsers
cask "google-chrome"

# Music
cask "kid3"
cask "xld"
cask "spotify"

# Video
cask "iina"
cask "mkvtoolnix"
cask "shottr"

# E-books
cask "sigil"
cask "calibre"

# Productivity
cask "raycast"
#cask "eudic"
cask "obsidian"
cask "zotero"

# IM
cask "wechat"
cask "discord"
cask "whatsapp"

# Utilities
cask "betterdisplay"
cask "keka"
cask "surge"
cask "squirrel"
cask "bitwarden"

# Development
cask "font-hack-nerd-font"
cask "font-jetbrains-mono-nerd-font"
cask "font-sketchybar-app-font"
cask "ghostty"
cask "visual-studio-code"
cask "cursor"
cask "claude-code"
cask "codex"
cask "orbstack"

# Invest
cask "futubull"

# MAC APPSTORE APPS
# ---------------
mas "Keynote", id: 409183694
mas "Bear", id: 1091189122
