# TAPS
# ---------------
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-drivers"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"

# BINARIES
# ---------------
# Monitoring
## an interactive process viewer
brew "htop"
## Cross-platform graphical process/system monitor
brew "bottom"

# Terminal
## Pluggable terminal workspace
brew "zellij"
## Cross-shell prompt
brew "starship"

# Updated built-in GNU utilities
brew "coreutils"
brew "diffutils"
brew "findutils"
brew "ed"
brew "grep"
brew "gawk"
brew "gnu-indent"
brew "gnu-sed"
brew "gnu-tar"
brew "gnu-which"
brew "gnutls"
brew "gzip"
brew "screen"
brew "watch"
brew "wdiff"
brew "wget"

# Updated built-in system tools
brew "readline"
brew "openssh"
brew "python"
brew "git"
brew "zsh"
brew "ruby"
brew "make"
brew "vim"

# Utilities
## alternative to find
brew "fd"
## alternative to ls
brew "exa"
## alternative to grep
brew "riggrep"
## alternative to cat or less
brew "bat"
## alternative to ps
brew "procs"
## alternative to du
brew "dust"
## alternative to df
brew "duf"
## alternative to autojumper
brew "zoxide"
## alternative to man
brew "tealdeer"
## alternative to ping
brew "gping"
## alternative to fzf
brew "sk"

# Editor
brew "neovim"

# General development tools
brew "cmake"
## Git extension for versioning large files
brew "git-lfs"
## Syntax-highlighting pager for git and diff output
brew "git-delta"
## Github Cli
brew "gh"
## Program that allows you to count code, quickly
brew "tokei"

# Python related tools
## Python version manager
brew "pyenv"
## Execute binaries from Python packages in isolated environments
brew "pipx"

# Go related tools
## Go version manager
brew "goenv"

# Node.js related tools
## Node.js version manager
brew "fnm"
## JavaScript package manager
brew "yarn"

# Mac OS X
brew "mas"

# CASK
# ---------------
# Storage
cask "baidunetdisk"

# Browsers
cask "arc"
cask "google-chrome"

# Music
cask "kid3"
cask "xld"
cask "spotify"

# Video
cask "iina"
cask "mkvtoolnix"
cask "shottr"

# E-books
cask "sigil"

# Productivity
cask "raycast"
cask "notion"
cask "logseq"

# IM
cask "wechat"
cask "slack"
cask "telegram-desktop"

# Raspberry
cask "balenaetcher"

# Utilities
cask "betterdisplay"
cask "the-unarchiver"
cask "clashx"
cask "karabiner-elements"

# Development
cask "font-hack-nerd-font"
cask "alacritty"
cask "visual-studio-code"
cask "fig"

# MAC APPSTORE APPS
# ---------------
mas "Keynote", id: 409183694
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Things 3", id: 904280696
