# TAPS
# ---------------
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-drivers"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
tap "afutured/openai-translator"

# BINARIES
# ---------------
# Updated built-in GNU utilities
brew "coreutils"    # GNU file, shell, and text utilities
brew "binutils"     # GNU binary tools for native development
brew "diffutils"    # GNU file comparison utilities
brew "findutils"    # GNU find, xargs, and locate
brew "grep"         # GNU grep, egrep and fgrep
brew "gawk"         # GNU awk utility
brew "gnu-sed"      # GNU implementation of the famous stream editor
brew "gnu-tar"      # GNU version of the tar archiving utility
brew "gnu-which"    # GNU implementation of which utility
brew "gnutls"       # GNU transport layer security (TLS)
brew "gzip"         # Data compression program
brew "screen"       # Terminal multiplexer
brew "watch"        # Run commands periorically
brew "wdiff"        # Display word differences between text files
brew "wget"         # Resuming download util

# Monitoring
brew "htop"         # An interactive process viewer (better top)
brew "bottom"       # Cross-platform graphical process/system monitor

# Terminal
brew "zsh"          # Z shell
brew "zellij"       # Pluggable terminal workspace
brew "starship"     # Cross-shell prompt

# Utilities
brew "aria2"        # Resuming download util (better wget)
brew "fd"           # Find entries (better find)
brew "exa"          # Listing files with info (better ls)
brew "riggrep"      # The silver searcher (better grep)
brew "bat"          # Output highlighting (better cat)
brew "procs"        # Advanced process viewer (better ps)
brew "dust"         # Display disk usage (better du)
brew "duf"          # Get info on mounted disks (better df)
brew "zoxide"       # Auto-learning navigation (better cd)
brew "tealdeer"     # Community-maintained docs (better man)
brew "gping"        # Interactive ping tool (better ping)
brew "broot"        # Navigate directory trees (better tree)
brew "fzf"          # Fuzzy Finder
brew "mcfly"        # Fly through your shell history
brew "topgrade"     # Upgrade everything
brew "thefuck"      # Magnificent app which corrects your previous console command

# Editor
brew "vim"          # Vi 'workalike' with many additional features
brew "neovim"       # New vim
brew "glow"         # Markdown reader

# General development tools
brew "cmake"        # Cross-platform make
brew "git"          # Distributed revision control system
brew "git-lfs"      # Git extension for versioning large files
brew "git-delta"    # Syntax-highlighting pager for git and diff output
brew "gh"           # Interact with GitHub PRs, issues, repos
brew "tokei"        # Count code (better cloc)

# Programming languages
brew "rust"         # Rust language
brew "ruby"         # Ruby language
brew "python"       # Python language
brew "pyenv"        # Python version manager
brew "pipx"         # Execute binaries from Python packages in isolated environments
brew "go"           # Go language
brew "goenv"        # Go version manager
brew "node"         # Node language
brew "fnm"          # Node.js version manager
brew "yarn"         # JavaScript package manager
brew "jq"           # Command-line JSON processor

# Mac OS X
brew "mas"          # Mac App Store command-line interface

# CASK
# ---------------
# Storage
cask "baidunetdisk"

# Browsers
cask "arc"
cask "google-chrome"

# Music
cask "kid3"
cask "xld"
cask "spotify"

# Video
cask "iina"
cask "mkvtoolnix"
cask "shottr"

# E-books
cask "sigil"

# Productivity
cask "raycast"
cask "notion"
cask "logseq"
cask "eudic"

# IM
cask "wechat"
cask "slack"
cask "telegram-desktop"

# Raspberry
cask "balenaetcher"

# Utilities
cask "betterdisplay"
cask "keka"
cask "clashx"
cask "karabiner-elements"
cask "squirrel"
cask "bitwarden"
cask "openai-translator"

# Development
cask "font-hack-nerd-font"
cask "alacritty"
cask "visual-studio-code"
cask "orbstack"

# Invest
cask "futubull"

# MAC APPSTORE APPS
# ---------------
mas "Keynote", id: 409183694
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Things 3", id: 904280696
mas "OpenCat", id: 6445999201
mas "Just Focus", id: 1135331024
