# TAPS
# ---------------
tap "homebrew/bundle"

# BINARIES
# ---------------
# Updated built-in GNU utilities
brew "coreutils"    # GNU file, shell, and text utilities
brew "binutils"     # GNU binary tools for native development
brew "diffutils"    # GNU file comparison utilities
brew "findutils"    # GNU find, xargs, and locate
brew "grep"         # GNU grep, egrep and fgrep
brew "gawk"         # GNU awk utility
brew "gnu-sed"      # GNU implementation of the famous stream editor
brew "gnu-tar"      # GNU version of the tar archiving utility
brew "gnu-which"    # GNU implementation of which utility
brew "gnutls"       # GNU transport layer security (TLS)
brew "gzip"         # Data compression program
brew "screen"       # Terminal multiplexer
brew "watch"        # Run commands periorically
brew "difftastic"   # Structural diff tool
brew "wget"         # Resuming download util

# Monitoring
brew "htop"         # An interactive process viewer (better top)
brew "bottom"       # Cross-platform graphical process/system monitor

# Terminal
brew "zsh"          # Z shell
brew "tmux"         # terminal workspace

# Utilities
brew "aria2"        # Resuming download util (better wget)
brew "curlie"       # The ease of use of httpie (better curl)
brew "fd"           # Find entries (better find)
brew "lsd"          # Listing files with info (better ls)
brew "ripgrep"      # The silver searcher (better grep)
brew "bat"          # Output highlighting (better cat)
brew "procs"        # Advanced process viewer (better ps)
brew "dust"         # Display disk usage (better du)
brew "duf"          # Get info on mounted disks (better df)
brew "zoxide"       # Auto-learning navigation (better cd)
brew "tealdeer"     # Community-maintained docs (better man)
brew "gping"        # Interactive ping tool (better ping)
brew "broot"        # Navigate directory trees (better tree)
brew "fzf"          # Fuzzy Finder
brew "atuin"        # Fly through your shell history
brew "topgrade"     # Upgrade everything
brew "navi"         # An interactive cheatsheet tool for the command-line
brew "direnv"       # Load and unload environment variables
brew "nexttrace"    # Visual route tracking

# Editor
brew "vim"          # Vi 'workalike' with many additional features
brew "neovim"       # New vim
brew "glow"         # Markdown reader

# General development tools
brew "cmake"        # Cross-platform make
brew "git"          # Distributed revision control system
brew "git-lfs"      # Git extension for versioning large files
brew "git-delta"    # Syntax-highlighting pager for git and diff output
brew "gh"           # Interact with GitHub PRs, issues, repos
brew "tokei"        # Count code (better cloc)
brew "stow"         # Symlink farm manager

# Programming languages
brew "ruby"         # Ruby language
brew "python"       # Python language
brew "pyenv"        # Python version manager
brew "pyenv-virtualenv" # A pyenv plugin to manage virtualenv
brew "go"           # Go language
brew "node"         # Node language
brew "fnm"          # Node.js version manager
brew "jq"           # Command-line JSON processor
brew "just"         # Just a command runner

# Docker
brew "docker"

# Mac OS X
brew "mas"          # Mac App Store command-line interface

# CASK
# ---------------
# Storage
cask "baidunetdisk"
cask "adrive"

# Browsers
cask "google-chrome"

# Music
cask "kid3"
cask "xld"
cask "spotify"

# Video
cask "iina"
cask "mkvtoolnix"
cask "shottr"

# E-books
cask "sigil"
cask "calibre"      # Add WordDumb, Goodreads

# Productivity
cask "raycast"
cask "eudic"
cask "obsidian"
cask "zotero"

# IM
cask "wechat"
cask "discord"
cask "whatsapp"

# Utilities
cask "betterdisplay"
cask "keka"
cask "surge"
cask "karabiner-elements"
cask "squirrel"
cask "bitwarden"
cask "bartender"

# Development
cask "font-hack-nerd-font"
cask "ghostty"
cask "visual-studio-code"
cask "cursor"
cask "orbstack"
#cask "apifox"

# Invest
cask "futubull"

# MAC APPSTORE APPS
# ---------------
mas "Keynote", id: 409183694
mas "Things 3", id: 904280696
mas "Bear", id: 1091189122
#mas "flomo", id: 1665341561
